In [69]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [70]:
# series example
# series is like single column of table. The series can be created by passing dictonary or array 
# array series
arrSe=[1,4,5,6,'tr']
series_array= pd.Series(arrSe)
series_array

0     1
1     4
2     5
3     6
4    tr
dtype: object

In [71]:
# the index should alsways match the number of items in array 
series_array2=pd.Series(arrSe,['one','two','three','four','five'])
series_array2

one       1
two       4
three     5
four      6
five     tr
dtype: object

In [72]:
# series with dictonary & name of series
dic_ser= {1:"we",2:"sdf",3:1}
series_dic=pd.Series(dic_ser,name="dic series")
series_dic

1     we
2    sdf
3      1
Name: dic series, dtype: object

In [73]:
# find out key(index)
print(1 in series_dic)
4 in series_array2

True

False

In [74]:
# data frame is like sql table
# with index as rows
# columns as columns
# from dic
dic_df = {1:'sa',2:'pu',3:'ay',4:'si'}
ind_dic=index=['a','b','c','d','e']
df_dic= pd.DataFrame(dic_df,index=ind_dic)
df_dic

    1   2   3   4
a  sa  pu  ay  si
b  sa  pu  ay  si
c  sa  pu  ay  si
d  sa  pu  ay  si
e  sa  pu  ay  si

In [165]:
# from numpy array
# rows id ( index)
dates_index = pd.date_range('20160101', periods=6)
# create colm values 
# create rnd number 6 rows 4 columns= 24 dataset
rnd_rows=np.random.randn(6,4)
# col names
name_col=['a','b','c','d']
df_dates =pd.DataFrame(rnd_rows, dates_index,name_col)
df_dates

                   a         b         c         d
2016-01-01 -0.950436  0.304565  0.182104  0.395584
2016-01-02  1.185124  0.751029  0.430218  0.635829
2016-01-03 -0.417796  0.834502 -1.077069  0.479441
2016-01-04 -0.822015  0.595849 -0.933080 -1.533299
2016-01-05 -0.371101 -0.055998 -1.767286 -1.194049
2016-01-06 -0.069974  0.842434 -1.320806  0.706629

In [76]:
# top 2
df_dates.head(2)

                   a         b         c         d
2016-01-01  0.562285  0.077735  0.290026 -0.970523
2016-01-02 -0.499484  1.090349  1.009595 -1.421146

In [77]:
# bottom 3
df_dates.tail(3)

                   a         b         c         d
2016-01-04  0.174519  1.027340 -0.298330 -1.399829
2016-01-05  0.569535  0.170832 -0.111705 -0.437133
2016-01-06 -0.017383  1.727032 -0.384574  0.169067

In [78]:
# info about rows key(index)
df_dates.index
# info about columns
df_dates.columns

#info abt values
df_dates.values

array([[ 0.56228546,  0.07773492,  0.29002644, -0.97052284],
       [-0.49948402,  1.09034948,  1.00959515, -1.42114632],
       [ 0.25484961,  1.26152007, -0.01884736, -0.67515042],
       [ 0.17451914,  1.02733967, -0.29833008, -1.39982859],
       [ 0.56953498,  0.17083185, -0.11170508, -0.4371331 ],
       [-0.01738339,  1.72703177, -0.3845736 ,  0.1690666 ]])

In [79]:
# *** very imp****describe : used to see quick stat summary mean , median etc
df_dates.describe()

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean   0.174054  0.892468  0.081028 -0.789119
std    0.400988  0.644142  0.512589  0.609973
min   -0.499484  0.077735 -0.384574 -1.421146
25%    0.030592  0.384959 -0.251674 -1.292502
50%    0.214684  1.058845 -0.065276 -0.822837
75%    0.485426  1.218727  0.212808 -0.496637
max    0.569535  1.727032  1.009595  0.169067

In [80]:
# transposing data frame
df_dates.T

   2016-01-01  2016-01-02  2016-01-03  2016-01-04  2016-01-05  2016-01-06
a    0.562285   -0.499484    0.254850    0.174519    0.569535   -0.017383
b    0.077735    1.090349    1.261520    1.027340    0.170832    1.727032
c    0.290026    1.009595   -0.018847   -0.298330   -0.111705   -0.384574
d   -0.970523   -1.421146   -0.675150   -1.399829   -0.437133    0.169067

In [81]:
# sorting by index
df_dates.sort_index(axis=1,ascending=True)
# sorting by column, by =column name
df_dates.sort_values(by='c',ascending=False)

                   a         b         c         d
2016-01-02 -0.499484  1.090349  1.009595 -1.421146
2016-01-01  0.562285  0.077735  0.290026 -0.970523
2016-01-03  0.254850  1.261520 -0.018847 -0.675150
2016-01-05  0.569535  0.170832 -0.111705 -0.437133
2016-01-04  0.174519  1.027340 -0.298330 -1.399829
2016-01-06 -0.017383  1.727032 -0.384574  0.169067

In [82]:
# selecting one column from data frame
df_dates.a
# or select by slicing row by [] 
#df_dates['b']

# slicing by row number as range from 1 to 3 (**not include***). so return row 1 and 2
df_dates[1:3]

# slcing by row unique or whatever present row range
df_dates['2016-01-03':'2016-02-04']

                   a         b         c         d
2016-01-03  0.254850  1.261520 -0.018847 -0.675150
2016-01-04  0.174519  1.027340 -0.298330 -1.399829
2016-01-05  0.569535  0.170832 -0.111705 -0.437133
2016-01-06 -0.017383  1.727032 -0.384574  0.169067

In [83]:
# selecting by label (loc) selecting single row, all column
df_dates.loc['20160101']

a    0.562285
b    0.077735
c    0.290026
d   -0.970523
Name: 2016-01-01 00:00:00, dtype: float64

In [84]:
# selecting by label (loc) selecting all row, all row , slec column
df_dates.loc[:,['a','b']]

# selecting by label (loc) selecting particular row(*** both inclusive), all row , slec column
df_dates.loc['20160101':'20160103',['a','b']]


# selecting by label (loc) selecting 1 row , slec column
df_dates.loc['20160103',['a','b']]

a    0.25485
b    1.26152
Name: 2016-01-03 00:00:00, dtype: float64

In [89]:

# selecting by label (loc) selecting particular row and column
df_dates.loc['20160101','a']

# **** selecting by at ( ** it is faster) selecting particular row and column
# error in running .look later
#df_dates.at[1,'b']

0.56228545868156077

In [98]:
# select by position , selecting 1 row
df_dates.iloc[1]
# select by position , selecting range of rows (1:3) and col (2:5)
df_dates.iloc[1:3,2:5]
# select by position , selecting specific of rows (2,3,4) and col (1,2,3)
df_dates.iloc[[2,3,4],[1,2,3]]

# select by position , selecting all rows  and specific col 
df_dates.iloc[:,1:3]


# select by position , selecting all  col and specific  rows
df_dates.iloc[1:3,:]

# select by position , particlau col and row
#df_dates.iloc[1,3]

# select by position , usinh iat (** faster)
df_dates.iat[1,3]

-1.4211463150879613

In [100]:
# filtering using condition.** its like where in sql. using whole daat set
df_dates[df_dates>0]

# filtering using condition.** its like where in sql. using on column. 
df_dates[df_dates.c>0]

                   a         b         c         d
2016-01-01  0.562285  0.077735  0.290026 -0.970523
2016-01-02 -0.499484  1.090349  1.009595 -1.421146

In [108]:
df2=df_dates
df2['E'] = ['one', 'one','two','three','four','three']
# is in method
df2[df2['E'].isin(['two','four'])]

                   a         b         c         d     E
2016-01-03  0.254850  1.261520 -0.018847 -0.675150   two
2016-01-05  0.569535  0.170832 -0.111705 -0.437133  four

In [123]:
# setting value. check the number of entries matches number of rows
df2['f']=[1,2,3,4,5,6]

# setting value. using at with name
df2.at['2016-01-04','b']=123

# setting value. using iat with name
df2.iat[2,4]=456

In [143]:
# missing data 
# create new columns
#df2 =df_dates.copy()
df2=df_dates.reindex(index=[1,2,3,4], columns=list(df_dates.columns) + ['G'])
# set some value
#df2.loc[1:2,'a':'E']=1
df2.loc[1:2,:]=1

In [154]:
# drop na out . show onky rows wheer nocolumn in NA
#df2.dropna(how='any')
# fill values for NA. but seems only for display , not into real data frame
#df2.fillna(value='3')
# gives boolean outut for data frame for null value check 
df2.isnull()

       a      b      c      d      E  (20160101, c)      f      G
1  False  False  False  False  False          False  False  False
2  False  False  False  False  False          False  False  False
3   True   True   True   True   True           True   True   True
4   True   True   True   True   True           True   True   True

In [ ]:
# stat opetion
df_dates.mean()
df_dates.mean(2)

In [170]:
#Applying function to data
df_dates.apply(np.cumsum)
# applying lambda functionon data 
df_dates.apply(lambda x:x.mean()-x.max())

a   -1.426157
b   -0.297037
c   -1.177871
d   -0.791607
dtype: float64

In [173]:
# counting number of value lime group by and count in sql
df_dates.a.value_counts()

 1.185124    1
-0.417796    1
-0.069974    1
-0.371101    1
-0.822015    1
-0.950436    1
Name: a, dtype: int64

In [180]:
# string menthods
series_str =pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat','',' The course is ok'])

In [181]:
# all elemenet lower case
series_str.str.lower()

0                     a
1                     b
2                     c
3                  aaba
4                  baca
5                   NaN
6                  caba
7                   dog
8                   cat
9
10     the course is ok
dtype: object

In [196]:
# join in data frame
# make the data frame with commomh id value and 1 col different
dic_left= {'id':['a','a'],'lval':[1,2]}
left_df = pd.DataFrame(dic_left)
#dic_right= {'id':['a','a','b'],'lval':[11,12,13]}
dic_right= {'id':['a','a','a'],'lval':[11,12,13]}
right_df = pd.DataFrame(dic_right)
right_df

  id  lval
0  a    11
1  a    12
2  a    13

In [200]:
# merge the tables. see the diff in below output. above change right to see diff how only commong key gets merged
#pd.merge(left_df,right_df,on='id')
#pd.merge(right_df,left_df,on='id')
# another way to merge
right_df.merge(left_df,on='id')

  id  lval_x  lval_y
0  a      11       1
1  a      11       2
2  a      12       1
3  a      12       2
4  a      13       1
5  a      13       2

In [211]:
# concat the new row in the data frame
df3=df_dates.copy()
#newrow = {'2017-01-01': np.random.randn(1,4)}
newrow = pd.Series({'2017-01-01': np.random.randn(1,4)})
# ignore_indes is very important
df3.append(newrow,ignore_index=True)
df3

                   a         b         c         d
2016-01-01 -0.950436  0.304565  0.182104  0.395584
2016-01-02  1.185124  0.751029  0.430218  0.635829
2016-01-03 -0.417796  0.834502 -1.077069  0.479441
2016-01-04 -0.822015  0.595849 -0.933080 -1.533299
2016-01-05 -0.371101 -0.055998 -1.767286 -1.194049
2016-01-06 -0.069974  0.842434 -1.320806  0.706629

In [248]:
# GROUPING OF DATA FRAME ** VERY IMPORTANT
df_grp=  pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                       'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                       'C' : np.random.randn(8),
                       'D' : np.random.randn(8)})
# sum by col like sql group by A , sum C & D only **** may be B is text so no sum
#df_grp.groupby('A').sum()

# sum by col like sql group by A and B and sum C & D 
#df_grp.groupby(['A','B']).sum()
# group by A and B for C only 
df_grp.groupby(['A','B'])['C'].sum()

A    B
bar  one      0.307341
     three    1.180761
     two      0.621821
foo  one      0.504145
     three    1.409473
     two     -1.525792
Name: C, dtype: float64

In [255]:
# stack
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz','foo', 'foo', 'qux', 'qux'],
   ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one    -0.726382  1.015754
      two    -1.305828  0.023294
baz   one     1.250525  0.193089
      two    -0.081204 -0.206699
foo   one    -0.928673  1.027520
      two    -1.705712 -0.591115
qux   one     0.188737 -0.100466
      two     0.416642 -1.623873

In [258]:
# convert column value in row ...?
stacked=df.stack()
stacked
# un stack as dataframe again
#unstacked = stacked.unstack()
#unstacked

first  second
bar    one     A   -0.726382
               B    1.015754
       two     A   -1.305828
               B    0.023294
baz    one     A    1.250525
               B    0.193089
       two     A   -0.081204
               B   -0.206699
foo    one     A   -0.928673
               B    1.027520
       two     A   -1.705712
               B   -0.591115
qux    one     A    0.188737
               B   -0.100466
       two     A    0.416642
               B   -1.623873
dtype: float64

In [269]:
# pivot table , first is name of data froame, values is column to pivot, index=row label in excel, columns in column label of excel
pd.pivot_table(df_grp,values='C',index=['A'],columns=['B'])
#df_grp

B         one     three       two
A
bar  0.307341  1.180761  0.621821
foo  0.252072  1.409473 -0.762896

In [278]:
# time range, start date , period count and freq= type of period , S is seconds, D is day, M is month
trng = pd.date_range('1/1/2012', periods=100, freq='S')
# sample create series
ts = pd.Series(np.random.randint(0, 500, len(trng)), index=trng)
ts.resample('10min').sum()

2012-01-01    24480
Freq: 10T, dtype: int32

In [294]:
# category. make category 
df_category = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df_category
# making category d
d= df_category["raw_grade"].astype('category')
#d= df_category["id"].astype('category')
# assign category some values
d.cat.categories=['very good','good','bad']
# assign more cat values
d.cat.set_categories(["very bad", "bad", "medium", "good", "very good"])
#print(d)

# putting category in data frame
df_category['catval']=d

# sort by category
df_category.sort_values('catval')

# group y category
df_category.groupby('catval').sum()

0    very good
1         good
2         good
3    very good
4    very good
5          bad
Name: raw_grade, dtype: category
Categories (3, object): [very good, good, bad]

0    very good
1         good
2         good
3    very good
4    very good
5          bad
Name: raw_grade, dtype: category
Categories (3, object): [very good, good, bad]

  id  lval_x  lval_y
0  a       1      11
1  a       1      12
2  a       2      11
3  a       2      12

In [162]:
#help(pd.DataFrame.mean)

In [139]:
df2

     a    b    c   d    E  (20160101, c)   f   G
1  1.0  1.0  1.0 NaN  NaN            NaN NaN NaN
2  1.0  1.0  1.0 NaN  NaN            NaN NaN NaN
3  NaN  NaN  NaN NaN  NaN            NaN NaN NaN
4  NaN  NaN  NaN NaN  NaN            NaN NaN NaN

                   a           b         c         d      E  (20160101, c)  f
2016-01-01  0.562285    0.077735  0.290026 -0.970523    one             12  1
2016-01-02 -0.499484    1.090349  1.009595 -1.421146    one             12  2
2016-01-03  0.254850    1.261520 -0.018847 -0.675150    456             12  3
2016-01-04  0.174519  123.000000 -0.298330 -1.399829  three             12  4
2016-01-05  0.569535    0.170832 -0.111705 -0.437133   four             12  5
2016-01-06 -0.017383    1.727032 -0.384574  0.169067  three             12  6

                   a         b         c         d      E  (20160101, c)  f
2016-01-01  0.562285  0.077735  0.290026 -0.970523    one             12  1
2016-01-02 -0.499484  1.090349  1.009595 -1.421146    one             12  2
2016-01-03  0.254850  1.261520 -0.018847 -0.675150    two             12  3
2016-01-04  0.174519  1.027340 -0.298330 -1.399829  three             12  4
2016-01-05  0.569535  0.170832 -0.111705 -0.437133   four             12  5
2016-01-06 -0.017383  1.727032 -0.384574  0.169067  three             12  6

                   a         b         c         d      E  (20160101, c)
2016-01-01  0.562285  0.077735  0.290026 -0.970523    one             12
2016-01-02 -0.499484  1.090349  1.009595 -1.421146    one             12
2016-01-03  0.254850  1.261520 -0.018847 -0.675150    two             12
2016-01-04  0.174519  1.027340 -0.298330 -1.399829  three             12
2016-01-05  0.569535  0.170832 -0.111705 -0.437133   four             12
2016-01-06 -0.017383  1.727032 -0.384574  0.169067  three             12

In [ ]:
#pd.date_range.__doc__
#help(pd.date_range)
help(np.random.rand)